In [1]:
import pandas as pd

In [8]:
teachers = pd.read_csv('teachers.csv')
rooms= pd.read_csv('room.csv')
classes = pd.read_csv('class.csv')

In [3]:
teachers

              Name Available_Timings            Teaching_Courses
0         John Doe         8:00-1:00                Math,Science
1       Jane Smith        10:00-3:00             English,History
2    Alice Johnson         9:00-2:00  Physics,Chemistry,Calculus
3    Michael Brown        11:00-4:00           Biology,Geography
4      Emily Davis        9:00-12:00                   Art,Music
5     David Wilson         1:00-5:00          Physical Education
6    Sophia Miller        12:00-3:00            Computer Science
7  Oliver Anderson        10:00-2:00        Economics,Psychology
8    Emma Thompson        11:00-4:00        Sociology,Literature
9     Daniel Clark        8:00-12:00            Foreign Language

In [9]:
rooms

   room_id  capacity
0      101        30
1      102        25
2      103        35
3      104        35
4      105        45
5      106        35
6      107        25

In [5]:
classes

   ID                                courses  capacity
0   1  Math,English,Science,Biology,Calculus        30

In [ ]:
timetable = {}